app/views/messages/show.html.erb

  <ul>
  <% @message.attachments.each do |attachment| %>
---
SELECT "attachments".* FROM "attachments" WHERE "attachments"."message_id" = ?  [["message_id", 1]]