app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."student_id" = ?  [["student_id", 1]]
---
  def index
    @messages = @student.messages.all

INSERT INTO "messages" ("content", "created_at", "student_id", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "how are you"], ["created_at", Fri, 09 May 2014 06:05:40 UTC +00:00], ["student_id", 1], ["title", "hello"], ["updated_at", Fri, 09 May 2014 06:05:40 UTC +00:00], ["user_id", 1]]
---
  def create
    @message = @student.messages.new(message_params)
    @message.user_id = current_user.id

    respond_to do |format|
      if @message.save

SELECT "messages".* FROM "messages" WHERE "messages"."student_id" = ? AND "messages"."id" = ? LIMIT 1  [["student_id", 1], ["id", "1"]]
---
    def set_message
      @message = @student.messages.find(params[:id])

SELECT "students".* FROM "students" WHERE "students"."id" = ? ORDER BY "students"."id" ASC LIMIT 1  [["id", 1]]
---
    def set_student
      @student = Student.find(params[:student_id])