app/controllers/students_controller.rb

  def index
    @search = Student.search(params[:q])
---
SELECT "students".* FROM "students"

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("address", "city", "country", "created_at", "email", "name", "phone", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)