app/controllers/users_controller.rb

  def show
    if current_user.admin?
      @user= User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1

  def edit
    if current_user.admin?
      @user= User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1

  def create
    if current_user.admin?
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "name", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    if current_user.admin?
      if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "New Name"], ["email", "new@example.com"], ["updated_at", Fri, 09 May 2014 06:09:03 UTC +00:00]]

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1